=== TS Webfonts for Standard Plan ===
Contributors: morisawa
Tags: fonts,Webfonts
Requires at least: 4.3.1
Tested up to: 5.6.2
Stable tag: 3.0.3
License: GPLv3 or later
License URI: http://www.gnu.org/licenses/gpl-3.0.html

このプラグインを利用することで、あなたのサイトにTypeSquareのWebフォントを簡単に設定できます。

== Description ==
このプラグインを利用することで、あなたのサイトにTypeSquareのWebフォントを簡単に設定できます。

= TypeSquareについて =
TypeSquareとはさまざまな書体をWebフォントとして利用できるモリサワのWebフォントサービスです。
Webフォントは、インターネットを介してフォントを配信する技術で、閲覧する環境にインストールされていない
フォントでもブラウザ上で表示することができます。
2012年度グッドデザイン賞金賞受賞およびグッドデザインベスト100に選出されました。

= Notice =
1. フォントの取得にはTypeSquareアカウントが必要となります。
TypeSquareアカウントの作成やご契約については、下記のブログ記事をご参照ください。
https://blog.typesquare.com/archives/53

2. 各プランで利用サイトURLが必要です。詳しくは、下記ブログ記事をご参照ください。
https://blog.typesquare.com/archives/155

3. プラグインの設定方法は、下記ブログ記事をご参照ください。
https://blog.typesquare.com/archives/55391

== Installation ==

1. 「TS Webfonts Plugin for Standard Plan」をプラグインディレクトリからダウンロードします。
2. WordPress管理画面の「プラグイン」から有効化します。
3. TypeSquareのアカウントを作成して、メールアドレスやパスワード・配信IDを取得します。
4. 管理画面の「TypeSquare Webfonts」にアクセスし、設定を行います。

== FAQ ==

= 管理画面から設定したフォントが適用されません =
TypeSquare管理画面でのWebサイトの登録が必要となります。
またプランによってはTypeSquare管理画面から利用フォントの申請が必要となりますので、
両設定が完了しているかをご確認ください。

= フォントテーマとはどういうものですか？ =
事前にフォントの組み合わせをテーマとして定義されているものです。
フォントテーマを利用することで、簡単にWebフォントを適用することができます。

= 投稿で設定したフォントテーマが設定されません =
管理画面の「投稿記事フォント設定」にて、「投稿記事に適用するフォント設定」が「指定しない」になっていないか確認してください。
「設定しない」に設定されている場合、設定したフォントテーマは無効化されます。

== Changelog ==
= 3.0.3 =
PHP8.0対応

= 3.0.2 =
軽微な不具合の修正

= 3.0.1 =
軽微な不具合の修正

= 3.0.0 =
メジャーバージョンアップを実施し、より使いやすくなりました。
* タイトルやウィジェットにもフォント適用可能に
* CSSスタイルを直接指定方法を見直し
* テーマ選択時、フォント選択時のプレビュー表示対応
* WordPress5.3に対応

= 2.1.0 =
* UI改善対応

= 2.0.4 =
* 認証時の不具合を修正

= 2.0.3 =
* 軽微な不具合の修正

= 2.0.2 =
* 軽微な不具合の修正

= 2.0.1 =
* style挿入位置の修正

= 2.0.0 =
* フォント個別設定機能の削除
* フォントテーマ生成機能の追加

= 1.1.0 =
* フォント個別設定機能の追加
* 無料プランでもメール認証で利用可能に

= 1.0.0 =
* Initial Releases


== Upgrade Notice ==
= 3.0.0 =
メジャーバージョンアップを実施し、より使いやすくなりました。
* タイトルやウィジェットにもフォント適用可能に
* CSSスタイルを直接指定方法を見直し
* テーマ選択時、フォント選択時のプレビュー表示対応
* WordPress5.3に対応

= 2.0.0 =
* フォント個別設定機能の削除
* フォントテーマ生成機能の追加
