=== Russian Currency ===
Contributors: Flector
Donate link: https://money.yandex.ru/to/41001443750704/200
Tags: currency, EUR, exchange, rouble, RUB, USD, CBR, currency, widget
Requires at least: 3.3
Tested up to: 6.6
Stable tag: trunk

Виджет с официальными и биржевыми курсами валют.

== Description ==

Плагин представляет собой виджет, который выводит текущие курсы валют - официальный курс, установленный ЦБ и биржевой курс (в настройках вы можете задать вывод лишь одного типа курсов).

В плагине поддерживается кэширование полученных данных (вы сами задаете время обновления курсов), поэтому установка виджета плагина не вызовет дополнительной нагрузки на ваш сайт.

Если вам понравился мой плагин, то <strong>пожалуйста</strong> поставьте ему 5 звезд.


== Installation ==

1. Скопируйте папку плагина в <strong>/wp-content/plugins/</strong>.
2. Активируйте плагин через меню <strong>Плагины</strong>.
3. Это все.


== Screenshots ==

1. Настройка виджета плагина.
2. Примерный вывод виджета.

== Changelog ==

= 1.53 (21.08.2020) =

* исправлена ошибка плагина при работе сайта на php 7.4.x

= 1.52 =

* исправлена ошибка с "нулевыми курсами" во время российских праздников
* исправлена ошибка плагина при работе сайта на php 7.x

= 1.51 =
* парсинг биржевых курсов временно переделан на использование forexpf.ru, так как гугл закрыл свой сервис

= 1.50 =
* парсинг биржевых курсов переделан на использование finance.google.com, так как yahoo.com свой сервис закрыл без предупреждения

= 1.02 =
* исправлена ошибка плагина при работе сайта на php 7.1.x

= 1.01 =
* исправлена ошибка с "нулевыми курсами" во время российских праздников

= 1.00 =
* первая версия
