=== Admin in menu ===
Contributors: fatoom
Donate link: 
Tags: admin, admin-panel, админка, админ-панель, шорткод
Requires at least: 4.6
Tested up to: 4.9
Stable tag: 4.9.4
License: GPLv2 or later
License URI: https://www.gnu.org/licenses/gpl-2.0.html

С этим плагином вы можете убрать стандартную админ-панель вордпресса для пользователей с уровнем доступа "подписчик". Плагин находится на стадии бета, в случае нахождения ошибок прошу обратиться к автору плагина.

== Description ==

С этим плагином вы можете убрать стандартную админ-панель вордпресса для пользователей с уровнем доступа "подписчик". Плагин находится на стадии бета, в случае нахождения ошибок прошу обратиться к автору плагина. У вас в распоряжении есть 3 шорткода: [admin-in-menu-user], [admin-in-menu-auth] и [admin-in-menu-reg]. Их можно вставлять на страницах вашего сайта. 

[admin-in-menu-user] создаёт форму авторизации, если пользователь не авторизован, в обратном случае форму редактирования аккаунта пользователя и ссылку для выхода. 

[admin-in-menu-auth] Делает то же, что и [admin-in-menu-user], кроме того, что если пользователь авторизован, форма для редактирования аккаунта не показывается.

[admin-in-menu-reg] Добавляет форму регистрации

== Installation ==

1. Скачайте плагин, загрузите в директорию /wp-content/plugins/ , после чего активируйте его в панели администратора. 
2. Используйте шорткоды описанные в описании плагина.

== Frequently Asked Questions ==

= Этот плагин совместим с любыми темами? =

К сожалению могут возникать ошибки при работе с некоторыми темами и плагинами от других разработчиков.

= Куда обращаться, если прозошла ошибка с работой плагина? =

Обращайтесь на страницу вконтакте https::/vk.com/npa98

== Screenshots ==

1. Вот так выглядит добавление шорткода на страницу

== Changelog ==

= 1.0 =

* Добавлена возможность вывода формы редактирования аккаунта с помощью шорткода.
* Пользователи с уровнем доступа "Подписчик" не видят стандартную панель администратора вордпресса.

= 1.1 =
* Изменена структура кода плагина.

= 1.2 =
* Изменена переадресация при авторизации и регистрации.

= 1.3.1 =
* Изменено поведение шорткодов
* Добавлен новый шорткод

= 1.3.2 =
* Добавлен новый шорткод

`<?php code(); // goes in backticks ?>`
