=== Mail365 Integration ===

Contributors: Vendosoft
Tags: рассылка, рассылки, программа для имейл рассылки, имейл рассылка, email рассылка, e-mail рассылка, массовая рассылка, e mail рассылка, mail365
Stable tag: 1.0.2
Tested up to: 4.5
License: GPLv2
License URI: http://www.gnu.org/licenses/gpl-2.0.html

WordPress Integration with Mail365

== Description ==

Плагин Mail365 для WordPress позволит вам создавать быстро и без труда перенести контакты Ваших пользователей в сервис Mail365

= Functionality =

<a href="http://www.mail365.ru">Mail365</a> – профессиональный сервис для рассылки электронной почты. 

Основные возможности подключения к Mail365: 

* Выгодные тарифы — от 250 рублей в месяц!
* Надёжная доставка во "Входящие"
* Удобный и быстрый интерфейс
* Умный импорт
* Возможность обширной фильтрации контактов
* Персонализация контактов
* Грамотная организация доступа к Вашим контактам
* Оригинальные предложения для рассылок
* Черный список и возможность самоотписки от рассылок
* Планировка Ваших рассылок и авторассылка смс по определенным событиям
* Подробная статистика по рассылками и красочная инфографика по контактам

<a href="http://www.mail365.ru">Зарегистрируйтесь</a> и ощутите всю прелесть и мощь сервиса Mail365

== Installation ==

= Автоматическая установка =

Автоматическая установка - простой и удобный вариант. Для этого необходимо в админ-панели WordPress перейти на страницу управления Плагинами и нажать кнопку "Добавить новый".

В поле поиска ввести "Mail365", выбрать в результатах плагин "Mail365" и нажать кнопку "Установить"

= Ручная установка =

Для установки плагина вручную, Вам необходимо скачать архив плагина с [его официальной страницы] (https://wordpress.org/plugins/mail365/).

Далее в админ-панели WordPress перейти на страницу управления Плагинами и нажать кнопку "Добавить новый".

Нажать кнопку "Загрузить плагин", прикрепить архив, установить и активировать.

= Автоматическое обновление =

Автообновление плагина происходит по стандартному сценарию WordPress. После появления новой версии плагина, Вы увидите сообщение об этом в админ-панели - нажмите на него и следуйте инструкциям.