=== 클레이풀 쇼핑 위젯 (썬더) ===
Contributors: clayful
Donate link:
Tags: eCommerce, clayful, 클레이풀, 쇼핑몰, 쇼핑위젯
Requires at least: 3.5
Tested up to: 5.3
Stable tag: 1.0.0
License: GPLv2 or later
License URI: http://www.gnu.org/licenses/gpl-2.0.html

워드프레스 웹사이트의 페이지와 글 어디에나 상품을 디스플레이하고, 구매하기 버튼을 달아보세요. 클레이풀의 쇼핑 위젯(썬더)를 이용하면 워드프레스 웹사이트를 순식간에 쇼핑몰로 변신시킬 수 있습니다.

== Description ==

워드프레스 웹사이트의 페이지와 글 어디에나 상품을 디스플레이하고, 구매하기 버튼을 달아보세요. [클레이풀의 쇼핑 위젯(썬더)](https://thunder.clayful.io/)를 이용하면 워드프레스 웹사이트를 순식간에 쇼핑몰로 변신시킬 수 있습니다.

썬더는 클레이풀(Clayful)의 판매 시스템과 연동되는 서비스입니다. 클레이풀에 대해서 더 자세히 알고 싶으시다면, [클레이풀의 공식 웹사이트](https://clayful.io/)를 참고해주세요.

플러그인 설치와 사용에 어려움을 겪으시거나 궁금한 점이 있으시다면 [클레이풀의 서포트 페이지](https://clayful.io/support)를 통해서 알려주세요.

= 설치 및 설정 =

1. 먼저 이 플러그인을 운영중인 워드프레스 사이트에 설치해주세요.
2. 설치가 완료되면 워드프레스 관리자 페이지 내 **플러그인** 페이지에서 **Clayful Thunder** 플러그인을 활성화 시켜주세요.
3. 상품을 등록하고 판매 정책을 설정하기 위해서 [클레이풀](https://clayful.io/)에 가입하고 운영하시려는 스토어를 개설해주세요.
4. 개설이 완료되면 스토어 관리자 페이지의 **연동 플러그인 > 쇼핑 위젯 (썬더)** 페이지에서 필요한 기능을 입맛에 맞게 설정한 뒤 썬더 설치용 코드를 생성해주세요.
5. 설정 이후 설치 코드를 생성하셨으면, 생성된 스타일, 스크립트 설치 코드를 워드프레스 관리자 페이지 내 **설정 > 클레이풀 쇼핑 위젯** 페이지 내 각 부분에 붙여넣어 주세요.

= 위젯 디스플레이 =

코드 설치가 완료되면 워드프레스 글, 페이지에서 다음과 같이 [쇼트코드(Short Code)](https://codex.wordpress.org/Shortcode)를 글 본문에 적어 상품 목록, 구매하기 버튼 등의 위젯을 삽입할 수 있습니다.

**예시) 상품 목록 디스플레이**

`[thunder action="render" component="product-list"]`

**예시) 버튼 클릭시 상품 상세 디스플레이**

하단의 예시 코드에서 `상품_ID` 부분을 실제 디스플레이하려는 상품의 ID 값으로 변경해서 사용할 수 있습니다.

`[thunder action="open" component="product-detail" product="상품_ID"]상품 보기[/thunder]`

이외에 디스플레이 가능한 위젯의 종류와 사용 문법은 [썬더 개발자 문서](https://thunder.clayful.io/dev.html)의 **컴포넌트** 섹션을 참고해주세요.

== Screenshots ==
 
1. 클레이풀의 스토어 관리자 페이지에서 설치용 코드를 설정하고 생성할 수 있습니다.
2. 생성된 설치 코드를 워드프레스의 플러그인 설정 페이지에서 설치할 수 있습니다.
3. 설치가 완료되면 글 또는 페이지에 쇼트코드를 통해서 판매용 위젯을 디스플레이할 수 있습니다.
4. 삽입된 상품 보기 페이지를 누르면 상품 상세 페이지가 디스플레이되고 주문을 할 수 있습니다.

== Changelog ==

= 1.0 =
* v1.0 릴리즈 

== Upgrade Notice ==

= 1.0 =
* v1.0 릴리즈 