=== Прием платежей через Миксплат для WooCommerce ===
Tags: mixplat, миксплат, woocommerce, прием платежей, оплата, эквайринг, банковская карта, сбп, мир, mir, sberpay, сберпей, сберпэй
Tested up to: 6.7.1
Stable tag: 1.0.8
License: GPLv3
License URI: http://www.gnu.org/licenses/gpl-3.0.html

Подключите оплату картами, СБП, Mir Pay и мобильные платежи на вашем сайте через Миксплат.

== Description ==

Плагин для приема платежей для WooCommerce с помощью банковских карт (интернет-эквайринг), СБП, SberPay, Mir Pay и мобильных платежей.

**Описание**

* 5 способов оплаты: банковские карты, СБП, SberPay, Mir Pay, мобильные платежи
* Подключение и абонентская плата — 0 ₽
* Комиссия — от 0.4%

**Возможности**

* Автоматическая смена статуса заказа после оплаты
* Интеграция с онлайн-кассой (фискализация по 54-ФЗ)
* Поддержка режима холдирования (двухстадийная схема оплаты)
* Частичные или полные возвраты через личный кабинет

Больше информации — на [сайте](https://mixplat.ru/).

**Порядок использования**

1. Оставить заявку на [сайте](https://mixplat.ru/) и заключить договор.
2. Получить доступ в личный кабинет.
3. Установить и настроить модуль согласно [инструкции](https://mixplat.ru/developers/wordpress-woocommerce-payment-module/).

== Changelog ==

= 1.0.0 (2023-03-23): =
* Публикация плагина в репозитории.

= 1.0.1-1.0.3 (2023-08-07): =
* Правки в файлах локализации.

= 1.0.4 (2023-08-08): =
* Протестировано с версией WordPress 6.2.2.

= 1.0.5 (2024-10-09): =
* Вывод платежного метода в блоках WooCommerce (новая версия checkout).
* Протестировано с версией WordPress 6.6.2.

= 1.0.6 (2024-12-03): =
* Исправлена критическая ошибка, возникающая при обновлении плагина.
* Протестировано с версией WordPress 6.7.1.

= 1.0.7 (2024-12-13): =
* Добавлена поддержка SberPay и Mir Pay.
* Исправлена ошибка передачи данных для фискализации.

= 1.0.8 (2025-02-05): =
* Добавлены значения НДС: 5%, 7%, 5/105, 7/107