=== AlsatPardakht Payment Gateway For for Easy Digital Downloads ===
author: AlsatPardakht
author URI: https://www.alsatpardakht.com/
Contributors: HKraToS
Tags: edd, easy digital downloads, alsatpardakht, farsi, e-commerce, alsatpardakht, آلسات پرداخت,درگاه پرداخت,payment gateway, درگاه
Requires at least: 4.5
Tested up to: 5.9
Stable tag: 1.0.0
License: GPLv2 or later
License URI: http://www.gnu.org/licenses/gpl-2.0.html

با نصب این پلاگین می توانید از خدمات درگاه واسط و مستقیم آل‌سات پرداخت برروی اسکریپت فروش فایل easy digital downloads استفاده کنید!


== Description ==

 این افزونه امکان فروش اینترنتی و آنلاین فایل را از طریق درگاه آل‌سات پرداخت به افزونه اضافه می کند.

با گسترش زیرساخت فن‌آوری اطلاعات و ارتباطات کشور عزیزمان ایران، در راستای توسعه و گسترش کسب و کارهای اینترنتی و سرویس‌دهندگان خدمات آنلاین، کمبودهای قابل ملاحضه و ناهماهنگی‌های متعددی در زمینه مدیریت امور مالی و راه‌اندازی درگاهی امن برای دریافت و پرداخت‌های روزانه بر بستر اینترنت، احساس می‌­شود. از طرفی، اخیراً نگرش عموم افراد جامعه در نحوه­‌ی به‌کار بردن سیستم‌های نوین پرداخت و انتقال وجوه، به معیارهایی همچون سهل‌الوصول بودن، سرعت تسویه حساب‌ها و دارا بودن زیرساخت امن تغییر کرده است.


در راستای پاسخ موثر به این نیازها و رفع دغدغه‌های مشترک در میان صاحبان کسب و کارهای مختلف، شرکت آل‌سات گستران حافظ، از سال 1396 و با هدف ارتقاء و پیشرفت شبکه پرداخت‌‌ الکترونیک کشور، فعالیت خود را، با رویکرد تسهیل در پرداخت‌های آنلاین و ارائه راهکارهای نوین پرداخت بدون کارت آغاز نموده است.


ما با بهره‌­مندی از استراتژی‌­ها و راهکارهای پیشرفته مالی و به‌کارگیری متدهای به‌روز در بانکداری مجازی دنیا، همچنین ایجاد و بسترسازی شبکه‌های نوین فناوری اطلاعات، برای ورود به حوزه­‌ی فین‌تک، برندی را با عنوان آل‌سات پرداخت (Alsat Pardakht) و با هدف تبدیل شدن به یکی از اپراتورهای موفق اجرایی کشور در این حوزه، به شبکه پرداخت الکترونیک ایران عزیزمان معرفی کردیم. تمام تلاش متخصصین این مجموعه اینست که؛ همچون شرکت­‌های نامدار و بزرگ جهانیِ در این عرصه، بستری امن و تجربه‌ای لذت‌بخش از پرداخت‌های مدرن را برای مردم و بسیاری از کسب و کارها، شرکت‌ها و سازمان‌ها فراهم سازیم تا روش‌های جدید و مطمئنی در مدیریت امور مالی و دریافت و پرداخت‌های خود داشته باشند.


شرکت آل‌سات پرداخت با نمایش توانمندی‌ها و فعالیت­‌های موفق خود در ایجاد زیرساخت‌های فنی و نرم‌افزاری، توانسته است؛ تفاهم نامه‌­های مختلفی را با PSPهای معتبر کشور امضا نموده و با اخذ مجوز رسمی از بانک مرکزی جمهوری اسلامی ایران و شبکه الکترونیکی پرداخت کارتی (شاپرک)، به عنوان پرداخت‌یار رسمی در شبکه­‌ی پرداخت کشور شناخته شود.


آل‌سات پرداخت در کنار ارائه خدمات پرداخت آنلاین، برنامه‌ریزی­‌های بلندمدتی را در زمینه کسب سهم قابل توجهی از بازار حوزه‌ پرداخت موبایلی و پرداخت‌های بدون کارت کشور انجام داده است. این مجموعه، با سرمایه‌گذاری و انجام پروژه‌­های تحقیقات راهبردی و استراتژیک در حوزه فین‌تک، همواره هدفی بزرگ در نفوذ به بازارهای داخلی و گسترش و شکوفایی صنعت فین‌تک کشور به سمت اتصال به شبکه بانکی جهانی را طی می‌نماید. همچنین اپلیکیشن این شرکت با ارائه و نمایش قدرتمندی از وب‌سرویس‌های عمومی و اختصاصی، مسیر نوینی در مدیریت نقدینگی روزمره و مدیریت پرداخت‌های رایج روزانه و ماهانه برای کاربران ترسیم نموده است.


== Installation ==
برای فعال سازی درگاه آل‌سات پرداخت مراحل زیر را دنبال کنید:

1. در سایت https://alsatpardakht.com ثبت نام کنید و درگاه ایجاد کنید.
2. پلاگین را نصب و فعال کنید.
3. به قسمت تنظیمات (پیکربندی) پلاگین و بخش درگاه های پرداخت مراجعه کنید.
4. درگاه آل‌سات پرداخت را فعال و در قسمت کد دریافتی از پنل (API) مقدار API درگاه خود را وارد کنید.
5. درآمد بیشتری کسب کنین.

== Screenshots ==
1-Plugin Settings screenshot-1.png
2-Set Product Price screenshot-1.png

== Changelog ==
= 1.0, 2022-02-10 =
* First release.

`<?php code(); ?>`