=== Plugin Name ===
Contributors: User Local Inc
Tags: heatmap, Japanese, analytics, analyze, click, click map, clicks, conversion tracking, pageviews, ヒートマップ, アクセス解析, google analytics
Tested up to: 5.6.2
Stable tag: 1.1.11
Requires at least: 4.2
Requires PHP: 5.4

無料でヒートマップ解析を行うプラグインです。ユーザーの行動を可視化して、コンバージョンアップ！

== Description ==

このプラグインは無料ヒートマップツールであるUserHeatをWordPressとワンステップで連携するためのプラグインです。

UserHeatは「ユーザーが画面のどこを見ているか」「どこをクリックしたか」などのヒートマップ解析が可能で、WEBサイトにアクセスしたユーザーの行動を可視化するアクセス解析ツールです。
30秒程度の登録作業だけで無料で利用することが可能です。


◆5種類のヒートマップ
・熟読エリアヒートマップ
・マウストラッキング
・クリックエリアヒートマップ
・終了エリアヒートマップ
・離脱エリアヒートマップ

◆PC・スマートフォンに対応
PC・スマホそれぞれのヒートマップ分析が可能です。

◆EFO（エントリーフォーム最適化）機能
お問い合わせフォームや登録フォームのどこで、ユーザーが離脱しているかをグラフィカルに分析します。

◆検索キーワード分析機能
GoogleSearchConsoleと連携することで、検索流入キーワードの分析が可能です。


<a href="https://userheat.com">UserHeatについてより詳しく見る</a>


== Installation ==

1. プラグインをインストールします。
2. UserHeatのサイトに移動し、URL・メールアドレス・パスワードなどを入力して登録します。
3. 発行されたサイトIDをプラグイン上で登録します。
4. 解析が始まるのでしばらくすると、訪れたユーザーの解析結果が見られるようになります。


== Changelog ==

= 1.1.11 =
* セキュリティ強化のための改善

= 1.1.10 =
* URLパラメータの設定の修正

= 1.1.9 =
* URLパラメータの設定を追加

= 1.1.8 =
* 管理画面の日本語訳を追加

= 1.1.7 =
* 管理画面の説明を拡充した

= 1.1.6 =
* 管理画面のメニュー上で競合する問題に対応

= 1.1.5 =
* 導入説明を追記

= 1.1.4 =
* 正常に動かないバグを修正

= 1.1.3 =
* PHP5.4未満のバージョンでも動作するように修正

= 1.1.2 =
* バグ修正

= 1.1.1 =
* 英語に対応

= 1.0.1 =
* 最初のバージョン
