=== AdPlus ===
Contributors: vashkatsi
Tags: adplus, monetize
Requires at least: 4.0.0
Tested up to: 4.7.2
Stable tag: 1.0.4

Плагин интеграции с сервисом adplus.io.

== Description ==

В случае, если сайт adplus.io или коробочная версия сервиса "упадет" - то пользователям будут показываться
дефолтные рекламные объявления, которые он указал в личном кабинете, при этом никакой таргетинг работать не будет.

Этот плагин нужен лишь для перестраховки, когда неполадки на сервере прекратятся и
он начнет работать в штатном режиме, то показ объявлений автоматически переключится обратно.

== Installation ==

1. Загрузите `adplus` в `/wp-content/plugins/`
2. Активируйте плагин на странице 'Плагины' в меню Wordpress

== Frequently Asked Questions ==

= Заменяет ли ваш плагин другие плагины типа Ad Inserter? =

Нет, он работает только как перестраховочный механизм.

== Screenshots ==

1. Главная страница плагина

== Changelog ==

= 1.0.4 =
* Фикс с кешированием

= 1.0.3 =
* Еще больше увеличено время ожидания до 300мс

= 1.0.2 =
* Увеличено время ожидания

= 1.0.1 =
* Небольшие фиксы и комментарии

= 1.0.0 =
* Первая версия, работает совместно с версией AdPlus 1.7
