 === Aparat ===
Contributors: nipoto
Donate link: http://uxDev.ir
Tags: aparat, video, clip, آپارات, ویدئو, responsive, ریسپانسیو, واکنش گرا
Requires at least: 3.0.1
Tested up to: 6.1
Stable tag: 1.7.1
License: GPLv2
License URI: http://www.gnu.org/licenses/gpl-2.0.html

نمایش ریسپانسیو ویدئوهای آپارات در مطالب توسط شورت‌کد ...

== Description ==

با فعالسازی این افزونه می‌توانید به سادگی ویدئوی آپارات مورد نظر خود را در مطلب ارسالی نمایش دهید ...

* شورت‌‌کد پیشفرض :
`[aparat id='iybdS']`

* شورت‌کد با امکان شخصی‌سازی :
`[aparat id='iybdS' width='600' height='450' style='margin: 15px; padding: 7px']`

= آی‌دی یا شناسه ویدئو = 
* به‌عنوان مثال شناسه ویدئوی http://www.aparat.com/v/iybdS عبارت است از : iybdS

= از افزونه حمایت کنید : =
[ * * * * * ](https://wordpress.org/support/plugin/aparat/reviews/?rate=5)

== Support ==
* [uxdev.ir](http://uxdev.ir/ "آزمایشگاه ایده نو")
* hi@uxdev.ir

== Installation ==

1. به برگه 'افزونه‌ها' در مدیریت وردپرس رجوع کرده و بر روی 'افزودن' کلیک کنید
2. 'Aparat' را جستجو کنید
3. افزونه ذکر شده را نصب کرده و توضیحات صفحه‌ی مدیریت آن را مطالعه کنید

== Changelog ==

= 1.7 =
* رفع مشکل تداخل عملکرد شورت کد با افزونه جلالی

= 1.6 =
* تغییرات جزیی در شورت کد برای عملکرد صحیح در ادیتور گوتنبرگ

= 1.5 =
* امکان ساخت خودکار شورت کد با قراردادن لینک آپارات

= 1.4.1 =
* اضافه شدن منوی توضیحات افزونه

= 1.4 =
* رفع مشکل نمایش ویدیو در حالت فعال بودن SSL

= 1.3 =
* گرفتن شناسه ویدئو از طریق گزینه آپارت در ادیتور

= 1.2.2 =
* رفع مشکل آدرس دهی آیکون آپارات

= 1.2 =
* اضافه شدن گزینه آپارات به ادیتور وردپرس

= 1.1 =
* پشتیبانی از حالت ریسپانسیو / طول 100 درصد
* حذف بوردر آی‌فریم ویدئو

= 1.0 =
* نسخه پایه

== Screenshots ==

1. افزودن شورت کد آپارات در 3 مرحله ساده