=== Form to mail ===
Contributors: karabov
Tags: contact, form, contact form, feedback, email, ajax
Requires at least: 4.7.5
Tested up to: 4.7.5
Stable tag: 4.7.5
License: GPLv2 or later

Отправка формы на почту по средствам ajax. Простое решение для разработки собственных тем.

== Description ==

Плагин позволяет обрабатывать формы на сайте, созданные вручную. Плагин не создает представление форм, а только обрабатывает их и отправляет письмо.

Плагин работает на PHP, начиная с версии 7.1 и jQuery. При работе плагина используется стандартный функционал WordPress, не создается дополнительный баз данных и не подгружаются сторонние скрипты.

== Installation ==

1. Загрузите плагин в папку `/wp-content/plugins/formtomail` , или установите через инсталятор WordPress plugins.
1. Активируйте плагин.
1. Создайте форму в вашем шаблоне.
1. Создайте запись `Форма` в административном кабинете, задав необходимые параметры.