=== فرم ساز فرم افزار ===
Contributors: formafzar Forms
Tags: forms, form builder, form plugin, wordpress contact form, custom forms,formafzar, formafzar forms, online forms, mobile forms, فرم ساز, فرمساز, فرم, web forms, تماس با ما, فرم استخدام,فرم تماس با ما, formafzar online forms
Donate link: https://formafzar.ir
Requires at least: 2.8
Tested up to: 6.0
Stable tag: 2.1
License: GPLv2 or later
License URI: https://www.gnu.org/licenses/gpl-2.0.html

ابزاری آسان برای ساخت فرم‌های آنلاین قدرتمند بصورت حرفه‌ای، به آسانی و کمتر از چند دقیقه فرم خودتون رو بسازید و به اشتراک بگذارید

== Description ==
برای فیلدهای فرم شرط تعیین نمایید تا در حالت‌های مختلف نمایش داده شده یا پنهان شوند.
با تغییر قالب و رنگ‌بندی اجزای فرم و قراردادن لوگوی کسب‌وکارتان فرم را با قالب تجاریتان منطبق نمایید.
توسط پلاگین وردپرس، بدون نیاز به دانش فنی و کدنویسی، فرم‌ها را در وبسایت خود قرار دهید

اگر صاحب هر کسب و کاری هستید با استفاده از فرم افزار می‌توانید فرایندهای درون و برون سازمانی خودتون رو بصورت فرم‌های الکترونیکی با امکانات فراوان طراحی کنید و بصورت آنلاین اطلاعات خودتون رو ثبت کنید.
همچنین اگر صاحب وبسایت هستید با استفاده از پلاگین وردپرس می‌توانید فرم‌های طراحی شده رو به راحتی در وبسایت خودتون قرار بدید 

با این پلاگین میتونید سیستم پرداخت خودتون رو راه اندازی کنید.


امکانات:
*   با ابزارهای مختلف می‌تونین هر نوع فرمی که لازم دارین طراحی کنین
*   کشیدن و رهاکردن
*   به سادگی فیلدها رو در فرم قرار دهید
*   تنظیم زمینه نمایش
*   فرم‌های زیبا و مطابق با برند و نام تجاری طراحی کنید
*   واکنش گرا
*   متناسب با ابزار مشاهده
*   فرم‌های چندمرحله‌ای
*   امکان ایجاد فرم به صورت چند مرحله‌ای
*   نقشه گوگل
*   پشتیبانی از نقشه گوگل
*   پرداخت آنلاین
*   امکان پرداخت آنلاین در فرم‌ها
*   اشتراک گذاری
*   در شبکه های اجتماعی فرم‌های را به اشتراک بگذارید
*   تغییر مسیر
*   بعد از ثبت فرم‌ کاربر را به وب سایت یا صفحه مورد نظر خود هدایت نمایید
*   محدودیت ثبت زمانی
*   در ساعات و روزهای مختلف امکان ثبت می‌توانید به فرم دهید
*   وب هوک
*   با ثبت هر فرم یک درخواست به سیستم شما ارسال می‌شود
*   ارسال پیامک و ایمیل
*   ارسال پیامک و ایمیل با اطلاعات فرم ثبت شده
*   ماژول وردپرس و جوملا
*   قابلیت نمایش فرم در وردپرس و جوملا
*   ابزارها
*   بیش از 30 ابزار مختلف برای طراحی فرم
*   فیلد متن
*   فیلد عدد
*   فیلد متن چند‌خطی
*   فیلد ایمیل
*   فیلد موبایل
*   فیلد تلفن
*   فیلد تاریخ
*   فیلد ساعت
*   فیلد برچسب
*   پنل بندی و مرحله سازی فرم با تمام ابزارهای موجود
*   لیست کشویی
*   لیست انتخابی
*   دکمه رادیویی
*   فیلد وضعیت
*   فیلد اسلایدر
*   فیلد تصویر انتخابی
*   فیلد وب‌سایت
*   فیلد رمز‌عبور
*   فیلد ضمیمه
*   فیلد‌های پیشرفته
*   فیلد جدول انتخابی
*   فیلد شرایط استفاده
*   لیست‌های مرتبط
*   ویرایشگر متن
*   امضاء دیجیتال
*   مالتی‌مدیا
*   فیلد رتبه
*   فیلد رضایتمندی
*   فیلد نقشه
*   فیلدهای تکرار شونده

== Installation ==
1.ابتدا در سایت [فرم افزار](https://formafzar.ir) عضو شوید و یک فرم ایجاد نمایید
2.شناسه امنیتی و شناسه فرم را از سربرگ \"اشتراک\" دریافت نمایید
3.پلاگین فرم افزار را در وردپرس نصب نمایید و در بخش embed گزینه فرم افزار را انتخاب و شناسه امنیتی و فرم را وارد نمایید

== Frequently Asked Questions ==
آیا نمونه فرم و نمونه قالب آماده دارید؟
در بخش قالب ها می توان از نمونه فرم های آماده و قالب های ثبت، چاپ و مشاهده استفاده نمایید

آیا امکان ارسال پیامک به ثبت کننده فرم وجود دارد؟
با استفاده از تعریف فرستنده پیامک از می توان تنظیم نمود که پیامک یا پیامک هایی به ثبت کننده و یا افراد دیگر ارسال شود، در متن ارسالی از متغیرهای فرم یا لینک های مورد نیاز می توانید استفاده نمایید

آیا مقدار چند فیلد را می توان با هم محاسبه کرد ؟
، با کمک فیلد فرمول در فرم ساز، می توان چهار عمل اصلی ریاضی را بر روی مقادیر ثبت شده اعمال نمود و خروجی را به کاربر نشان داد همچنین عملیات پرداخت را با مقدار بدست آماده انجام داد.

آیا می توان از پرداخت آنلاین در فرم استفاده کرد؟
بله، شما می توانید با چند کلیک هزینه سرویس یا محصول خود را از مشتری هایتان با فرم ساز دریافت نمایید و امکان ارسال لینک پرداخت با پیامک و ایمیل وجود دارد راهنمای پرداخت آنلاین

== Screenshots ==
1. فرم ساز
2. فرم ساز
3. فرم ساز

== Changelog ==
نسخه 2.1
رفع باگ

== Upgrade Notice ==
امکان انتخاب رنگ حالت انتخاب فیلد در بخش شخصی سازی قالب های ثبت
امکان فعال و غیرفعال کردن دکمه تایید و تغییر رنگ در بخش شخصی سازی قالب های ثبت