=== Farsi Font for Elementor ===

Contributors: 			Pixer
Donate link: 				https://idpay.ir/babakfp
Tags: 							farsi, farsi font, farsi font elementor, فونت فارسی, فونت فارسی المنتور, فونت فارسی برای المنتور
Requires at least: 	5.0
Tested up to: 			6.0
Stable tag: 				2.9.0
Requires PHP: 			7.4
License: 						GPLv2 or later
License URI: 				https://www.gnu.org/licenses/gpl-2.0.html


== Description ==

فونت فارسی وزیرمتن (همان نسخه جدید فونت وزیر) را به صفحه‌ساز المنتور شما اضافه میکند. اگر قالب‌ای که استفاده میکنید استاندارد باشد, از تنظیمات خود المنتور میتوانید فونت تمام سایت را با یک کلیک تغییر دهید.

راهنمای فونت‌ها:
- FD: فونتی که همه اعداد در سایت شما را به صورت فارسی نمایش میدهد.
- NL: فونتی که از الفبای انگلیسی پشتیبانی نمیکند.
- NL: فونتی که دارای نقطه‌های گرد میباشد.


== Screenshots ==

1. امکان تغییر فونت یک متن با استفاده از تنظیمات خود المنتور.
2. امکان تغییر فونت سایت به صورت سراسری جهت اعمال در کل سایت.


== Frequently Asked Questions ==

= آیا در بروزرسانی‌های جدید, فونت‌های بیشتری اضافه خواهد شد؟ =
خیر

= آیا در بروزرسانی‌های جدید, فونت پولی اضافه خواهد شد؟ =
خیر


== Changelog ==

= 2.9.0 =
* حل مشکل کار نکردن فونت با نقطه‌های گرد.

= 2.8.0 =
* فونت وزیر با فونت وزیرمتن جایگزین شد.
* اضافه شدن وزن‌های جدید.
* اضافه شدن نسخه نقظه‌های گرد.
* حل مشکلات جزئی..

= 2.5.0 =
* حل مشکل اختلال توابع با سایر افزونه‌ها.

= 2.4.0 =
* توجه: از این نسخه به بعد دیگه این افزونه کار زیباسازی ظاهر ویرایشگر المنتور را انجام نخواهد داد. برای زیباسازی ظاهر ویرایشگر المنتور میتوانید از این افزونه https://wordpress.org/plugins/wp-administration-style استفاده کنید.
* تغییر نام فونت‌ها به Vazir_FD_WOL و Vazir_WOL.
* نوع‌های جدید برای فونت وزیر (Vazir, Vazir_FD, Vazir_FD_WOL, Vazir_WOL)
* حذف فرمت‌های فونت که لازم نیستند.

= 2.0.0 =
* توجه: باید فونت سایت خود را دوباره تنظیم کنید
* فونت VazirFDWOL اعداد انگلیسی را به شکل فارسی نمایش میده و فونت VazirWOL فقط حروف و اعداد فارسی رو پشتیبانی میکنه.
* بروزرسانی فونت وزیر
* نام گذاری مناسب فونت وزیر
* بروزرسانی کدهای قدیمی

= 1.1.7 =
* بروزرسانی: فونت وزیر از نسخه ۱۹.۰.۰ به نسخه (جدیدترین) ۲۶.۰.۲ بروزرسانی شد. در نتیجه‌ی این بروزرسانی, حجم فونت‌ها کاهش پیدا کرده و سرعت لود سایت بهبود خواهد یافت.
* تغییراتی ریز در صفحه ویرایشگر المنتور.

= 1.0.5 =
* همگام سازی برای عملکرد بهتر با سایر قالب‌ها افزونه‌ها.