=== AlsatPardakht Payment Gateway For Woocommerce ===
Contributors: HKraToS
Author: AlsatPardakht
Author URI: http://www.alsatpardakht.com/
Tags: woocommerce,alsatpardakht, iran, persian, farsi,woocommerce persian, e-commerce, ووکامرس, ووکامرس فارسی,alsatpardakht woocommerce,آلسات پرداخت,درگاه پرداخت,payment gateway,woocommerce payment
Requires at least: 4.5
Tested up to: 5.9
Stable tag: 1.1.2
License: GPLv2 or later
License URI: http://www.gnu.org/licenses/gpl-2.0.html
Requires PHP: 7.0

== Description ==
**Woocommerce AlsatPardakht Gateway** این افزونه شما را قادر می سازد تا براحتی اقدام به ایجاد درگاه پرداخت اینترنتی برای پرداخت های محصولات ووکامرس کنید

با گسترش زیرساخت فن‌آوری اطلاعات و ارتباطات کشور عزیزمان ایران، در راستای توسعه و گسترش کسب و کارهای اینترنتی و سرویس‌دهندگان خدمات آنلاین، کمبودهای قابل ملاحضه و ناهماهنگی‌های متعددی در زمینه مدیریت امور مالی و راه‌اندازی درگاهی امن برای دریافت و پرداخت‌های روزانه بر بستر اینترنت، احساس می‌­شود. از طرفی، اخیراً نگرش عموم افراد جامعه در نحوه­‌ی به‌کار بردن سیستم‌های نوین پرداخت و انتقال وجوه، به معیارهایی همچون سهل‌الوصول بودن، سرعت تسویه حساب‌ها و دارا بودن زیرساخت امن تغییر کرده است.

در راستای پاسخ موثر به این نیازها و رفع دغدغه‌های مشترک در میان صاحبان کسب و کارهای مختلف، شرکت آل‌سات گستران حافظ، از سال 1396 و با هدف ارتقاء و پیشرفت شبکه پرداخت‌‌ الکترونیک کشور، فعالیت خود را، با رویکرد تسهیل در پرداخت‌های آنلاین و ارائه راهکارهای نوین پرداخت بدون کارت آغاز نموده است.

ما با بهره‌­مندی از استراتژی‌­ها و راهکارهای پیشرفته مالی و به‌کارگیری متدهای به‌روز در بانکداری مجازی دنیا، همچنین ایجاد و بسترسازی شبکه‌های نوین فناوری اطلاعات، برای ورود به حوزه­‌ی فین‌تک، برندی را با عنوان آل‌سات پرداخت (Alsat Pardakht) و با هدف تبدیل شدن به یکی از اپراتورهای موفق اجرایی کشور در این حوزه، به شبکه پرداخت الکترونیک ایران عزیزمان معرفی کردیم. تمام تلاش متخصصین این مجموعه اینست که؛ همچون شرکت­‌های نامدار و بزرگ جهانیِ در این عرصه، بستری امن و تجربه‌ای لذت‌بخش از پرداخت‌های مدرن را برای مردم و بسیاری از کسب و کارها، شرکت‌ها و سازمان‌ها فراهم سازیم تا روش‌های جدید و مطمئنی در مدیریت امور مالی و دریافت و پرداخت‌های خود داشته باشند.

شرکت آل‌سات پرداخت با نمایش توانمندی‌ها و فعالیت­‌های موفق خود در ایجاد زیرساخت‌های فنی و نرم‌افزاری، توانسته است؛ تفاهم نامه‌­های مختلفی را با PSPهای معتبر کشور امضا نموده و با اخذ مجوز رسمی از بانک مرکزی جمهوری اسلامی ایران و شبکه الکترونیکی پرداخت کارتی (شاپرک)، به عنوان پرداخت‌یار رسمی در شبکه­‌ی پرداخت کشور شناخته شود.

آل‌سات پرداخت در کنار ارائه خدمات پرداخت آنلاین، برنامه‌ریزی­‌های بلندمدتی را در زمینه کسب سهم قابل توجهی از بازار حوزه‌ پرداخت موبایلی و پرداخت‌های بدون کارت کشور انجام داده است. این مجموعه، با سرمایه‌گذاری و انجام پروژه‌­های تحقیقات راهبردی و استراتژیک در حوزه فین‌تک، همواره هدفی بزرگ در نفوذ به بازارهای داخلی و گسترش و شکوفایی صنعت فین‌تک کشور به سمت اتصال به شبکه بانکی جهانی را طی می‌نماید. همچنین اپلیکیشن این شرکت با ارائه و نمایش قدرتمندی از وب‌سرویس‌های عمومی و اختصاصی، مسیر نوینی در مدیریت نقدینگی روزمره و مدیریت پرداخت‌های رایج روزانه و ماهانه برای کاربران ترسیم نموده است.

== Installation ==

* 1-فعال سازی
اولین گام برای استفاده از درگاه پرداخت آلسات پرداخت فعال نمودن گزینه ی فعال سازی می باشد. (باید داخل کادر تیک داشته باشد)


* 2-درگاه مستقیم
اگر سرویسی که از آلسات پرداخت تهیه نموده اید درگاه پرداخت مستقیم می باشد می بایستی این گزینه را فعال کنید.


* 3-وارد کردن عنوان
برای درگاه عنوان متناسب با وب سایت و خدمات خود وارد نمایید.


* 4-توضیحات درگاه
شما میتوانید توضیحات خود را درباره درگاه خود در این قسمت بنویسید.


* 5-تنظیم کد یکتا (api key)
در این مرحله باید کلید یکتای خود (api کد) را که از سایت آلسات پرداخت تهیه کرده اید در قسمت کد api وارد نمایید.


* 6-پیام پرداخت موفق
در این قسمت میتوانید پیام مورد نظر خود را که بعد از پرداخت موفق به کاربر سایت شما نمایش داده شود وارد کنید.


* 7-پیام پرداخت ناموفق
در صورت ناموفق بودن پرداخت پیامی که در این کادر نوشته می شود به کاربر سایت شما نمایش داده خواهد شد.

برای اطلاعات و راهنمایی بیشتر از طریق لینک زیر میتوانید اقدام کنید
https://www.alsatpardakht.com/Plugin/969

== Screenshots ==
1-Activating Plugin screenshot-1.png
2-Settings Of Plugin screenshot-2.png


== Changelog ==
= 1.1.2, 2022-02-16 =
* برطرف شدن مشکلات گزارش شده

= 1.1.1, 2022-02-16 =
* برطرف شدن مشکلات گزارش شده

= 1.1, 2022-01-28 =
* اضافه شدن درگاه واسط

= 1.0, 2021-08-04 =
* First release.

`<?php code(); ?>`