=== Integration of Bitrix24 with Contact Form 7 ===
Contributors: Alex Osmanov
Donate link: https://yoomoney.ru/to/4100111668392524/
Tags: contact form 7, bitrix24, integration, cf7, bitrix
Requires at least: 4.9
Tested up to: 6.6.2
Stable tag: 1.5.0
Requires PHP: 5.6
License: GPLv2 or later
License URI: https://www.gnu.org/licenses/gpl-2.0.html

Плагин для интеграции Битрикс24 с контактной формой 7.

== Описание ==

Плагин "Интеграция Contact Form 7 с Bitrix24" позволяет автоматически отправлять данные из контактных форм на вашем сайте WordPress в ваш портал Bitrix24. Контактная информация будет добавлена в виде новых контактов и сделок. Плагин также поддерживает отправку UTM-меток для отслеживания источников трафика и улучшения анализа маркетинговых кампаний.

=== Новые функции ===
- Поддержка нескольких контактных форм: Плагин может интегрироваться с несколькими контактными формами на вашем сайте, каждая из которых будет отправлять свои данные в Bitrix24.
- Автоматическое заполнение полей: Плагин автоматически заполняет поля UTM-меток (utm_source, utm_medium, utm_campaign, utm_content, utm_term) из URL-адреса, что позволяет отслеживать эффективность ваших маркетинговых усилий.
- Логирование ошибок: Плагин ведет журнал ошибок и успешных операций, что позволяет проще диагностировать проблемы с интеграцией.
- Улучшенный интерфейс настроек: Страница настроек плагина теперь имеет более удобный и интуитивно понятный интерфейс с добавлением стилей.
- Возможность настройки пользовательских полей: Вы можете настроить пользовательские поля для передачи в Bitrix24, что позволяет вам адаптировать интеграцию под ваши специфические бизнес-процессы.

== Установка ==

Если необходима помощь в настройки плагина, могу оказать такую услугу обращайтесь по почте hi@alexosmanov.ru

1. Загрузите плагин в каталог `/wp-content/plugins/` вашего сайта.
2. Войдите в административную панель вашего сайта на WordPress, перейдите в раздел "Плагины" и найдите "Интеграция Contact Form 7 с Bitrix24" в списке.
3. Нажмите "Активировать" для включения плагина.

== Инструкция по использованию ==

1. Активация плагина: Установите и активируйте плагин "Integration of Bitrix24 with Contact Form 7" из официального репозитория WordPress.

2. **Настройка подключения к Bitrix24:**
   - Перейдите в административной панели WordPress "CF7 Bitrix24 Integration".
   - Заполните следующие поля на странице настроек:
     - **Bitrix24 URL:** Укажите URL вашего портала Bitrix24 API, который имеет следующую структуру: `https://ваш_поддомен.bitrix24.ru/rest/1/ваш_ключ/crm.lead.add.json`.
     - **Bitrix24 логин:** Введите логин пользователя Bitrix24 с правами на добавление новых контактов и сделок.
     - **Bitrix24 пароль:** Укажите пароль пользователя Bitrix24.

3. **Сохранение настроек:** Нажмите кнопку "Сохранить изменения", чтобы сохранить настройки подключения.

4. **Настройка контактной формы:**
   - Создайте новую контактную форму или отредактируйте уже существующую в разделе "Контактные формы" > "Contact Forms" в административной панели WordPress.
   - Убедитесь, что в вашей контактной форме присутствуют следующие поля: имя, телефон, email.
   - Сохраните настройки контактной формы.
   - Добавьте следующие скрытые поля в вашу форму для передачи UTM-меток:
     
     
     [hidden utm_source default:get param:utm_source "utm_source"]
     [hidden utm_medium default:get param:utm_medium "utm_medium"]
     [hidden utm_campaign default:get param:utm_campaign "utm_campaign"]
     [hidden utm_content default:get param:utm_content "utm_content"]
     [hidden utm_term default:get param:utm_term "utm_term"]

5. Размещение формы на сайте:
   - Вставьте контактную форму на нужную страницу вашего сайта с помощью шорткода `[contact-form-7 id="X" title="Заголовок формы"]`, где "X" - это ID вашей контактной формы, а "Заголовок формы" - это её название.

6. Отслеживание заявок:
   - Когда пользователи заполняют и отправляют форму на вашем сайте, данные будут передаваться в Bitrix24.
   - В Bitrix24 вы сможете просматривать и обрабатывать полученные заявки, которые будут автоматически создаваться как новый лид.

7. Настройка интеграции в Bitrix24:
   - Перейдите в свой аккаунт Bitrix24.
   - Откройте раздел "CRM".
   - Выберите "Интеграции" и затем "Интегрировать с внешними системами".
   - Нажмите "Добавить лиды".

Следуя этой инструкции и учитывая правильный формат Bitrix24 URL, вы сможете настроить интеграцию вашей контактной формы на WordPress с вашим аккаунтом Bitrix24 и автоматизировать процесс управления заявками и контактами.

== Frequently Asked Questions ==

= Вопрос: Поддерживает ли плагин множественные контактные формы? =

Ответ: Да, плагин поддерживает интеграцию с несколькими контактными формами. Каждая форма будет отправлять данные в ваш портал Bitrix24.

== Screenshots ==

1. Страница настроек плагина "Интеграция Contact Form 7 с Bitrix24".

== Upgrade Notice ==

= 1.5.3 =
Добавлены новые поля, сообщения (комментарий) и наименования компании. Поле для фамилии больше не функционирует. 


= 1.5.0 =
Добавлены новые функции, включая поддержку множественных форм, автоматическое заполнение UTM-меток, улучшенное логирование и интерфейс настроек.

= 1.2.4 =
Сделан вывод настроек отдельным пунктом.
Добавлены стили на страницу настройки плагина.
Добавлено отправление UTM-меток.

= 1.2.1 =
Убраны предупреждения о "headers already sent". Эти предупреждения возникали из-за вывода данных перед отправкой заголовков HTTP. Теперь код плагина исправлен так, чтобы не было никакого вывода перед работой с HTTP-заголовками.
Обновлены комментарии и описания в коде для лучшей читаемости и понимания.
Доработан функционал отправки заявок и улучшена инструкция по использованию.

= 1.1.1 =
Исправлены некоторые ошибки и улучшена совместимость с последними версиями WordPress и Contact Form 7.

== Changelog ==

= 1.5.0 =
Добавлены новые функции, включая поддержку множественных форм, автоматическое заполнение UTM-меток, улучшенное логирование и интерфейс настроек.

= 1.2.4 =
Сделан вывод настроек отдельным пунктом.
Добавлены стили на страницу настройки плагина.
Добавлено отправление UTM-меток.

= 1.2.1 =
Убраны предупреждения о "headers already sent". Эти предупреждения возникали из-за вывода данных перед отправкой заголовков HTTP. Теперь код плагина исправлен так, чтобы не было никакого вывода перед работой с HTTP-заголовками.
Обновлены комментарии и описания в коде для лучшей читаемости и понимания.
Доработан функционал отправки заявок и улучшена инструкция по использованию.

= 1.1.1 =
Исправлены некоторые ошибки и улучшена совместимость с последними версиями WordPress и Contact Form 7.

= 1.0.0 =
Первый релиз.
