===  الزر -لملم- ===
Contributors: bml13
Tags: لملم, عربية, lamlim, social, arabic, bookmarks, backlinks, visitors
Requires at least: 3.0
Tested up to: 4.7
Stable tag: 0.4
License: GPLv2 or later
License URI: http://www.gnu.org/licenses/gpl-2.0.html
Stable tag: trunk

إضافة الزر لملم إلى صفحات موقعك تسهل على الزوار نشر صورك و روابطك على Lamlim.com 
== Description ==
<div style="direction: rtl;">
    

إضافة الزر "لملم" الى مقالاتك و صفحاتك لكي يستطيع الزوار اضافة صور و روابط من موقعك الى موقع المفضلة الاجتماعية العربية <a href="http://lamlim.com">لملم</a> .<br> هذا سيساعدك على جلب زوار أكثر من موقع لملم الى موقعك..<br> <a href="http://lamlim.com">lamlim</a>
</div>

### Lamlim Button Features:###
الزوار يمكنهم:<br>
1- اختيار اي صورة في الصفحة لارفاقها مع الرابط.<br>
2- اضافة صور و روابط على لوحاتهم في موقع لملم.<br>
المشرف يمكنه:.<br> 
1- ترك الزوار اختيار اي صورة في الصفحة.<br>
2- فرض استعمال الصورة الأولى في المقال دائما.<br>
3- تحديد نوع الصفحات التي سيظهر عليها الزر.<br>
4- تحديد مكان الزر في الصفحة.<br>
5- ضبط محاذات الزر.<br>
== Installation ==
<div style="direction: rtl;">
1- أدخل لوحة التحكم في موقعك أو مدونتك واذهب إلى (الإضافات > أضف جديد).<br>
2- قم بالبحث عن "lamlim" او "لملم".<br>
3- انقر على "التنصيب الآن".<br>
4- قم بتفعيل الإضافة.<br>
</div>
== Screenshots ==

1. صفحة الإعدادات.
2. الزر "لملم" كما هو ظاهر أسفل التدوينة.

== Changelog ==
= 0.4.0 =
* تأكيد المطابقة مع ووردبريس 4.7
= 0.3.0 =
* تحديث منصة لملم
= 0.2.0 =
* تصحيح بعض الأخطاء في صفحة الإعدادات
* بعض التحسينات
= 0.1.0 =
* أول اصدار
